DataProcessors/СервисДеск.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>СервисДеск</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УзелПланаОбмена</Name>
					<Type>
						<v8:Type>cfg:ExchangePlanRef.ОбменFirestore</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/РезультатыВыполненияОбработок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>РезультатыВыполненияОбработок</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Успешный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СообщенияОбОшибках</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторОбработки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючОбработки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/РолиСервисДеск.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>РолиСервисДеск</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Создание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выполнение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Закрытие</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипРоли</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыРолейСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Посетители</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Оборудование</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Оборудование</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОборудованиеПоставщиков</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ФизическиеЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ФизическиеЛица</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пол</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПолФизическогоЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоРождения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>240</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыДоступаФизическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФИО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УточнениеНаименования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Comment>Дата регистрации</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеСлужебное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фотография</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Файлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоДРФО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоКассир</Name>
					<Comment>Признак того, что сотрудник является кассиром</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛогинНаКассу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольНаКассу</Name>
					<Comment>Пароль на кассу, если установлен, то сотрудник является кассиром</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШтрихКодНаКассу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>13</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрофильКассира</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрофилиКассиров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/СервисДеск/Ext/ObjectModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2024, Тихий.
// Все права защищены.)) 
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	
	#Область СлужебныйПрограммныйИнтерфейс
	
	
	Функция ВыгрузитьДанныеВFirestore(Данные)	Экспорт
		
		ВсеОК = Истина;
		ТаблицаСотрудников = Новый ТаблицаЗначений;
		ТаблицаПодразделений = Новый ТаблицаЗначений;
		ТаблицаТочек = Новый ТаблицаЗначений;
		
		ТекстОшибок = "";
		РезВО = РегистрыСведений.РезультатыВыполненияОбработок;	
		СтрЗР = РезВО.СформироватьСтруктуруЗаписиРезультатов();
		СтрЗР.ИдентификаторОбработки = "ВыгрузкаДанныхВFirestore";
		СтрЗР.КлючОбработки = "Выгрузка данных в Firestore";
		
		ПараметрыДляЗапроса = Новый Структура("Service_CloudFirestoreAPI, Service_IdentityToolkitAPI, Project_ID, Web_API_Key, UserUID");
		ЗаполнитьЗначенияСвойств(ПараметрыДляЗапроса, УзелПланаОбмена);
		СоединениеFire = Обработки.СервисДеск.СоединениеFire(ПараметрыДляЗапроса.Service_CloudFirestoreAPI);
		
		СоответствиеКоллекций = Новый Соответствие;
		СоответствиеКоллекций.Вставить("Справочник.ПодразделенияКомпании","subdivision");
		СоответствиеКоллекций.Вставить("Справочник.Посетители","sotrudniki");
		СоответствиеКоллекций.Вставить("Справочник.РолиСервисДеск","roli");
		СоответствиеКоллекций.Вставить("Справочник.ТерриторииИсполнителей","territories");
		СоответствиеКоллекций.Вставить("Справочник.ТорговыеПлощадки","markets");
		СоответствиеКоллекций.Вставить("Справочник.УслугиСервисДеск","task_categories");
		СоответствиеКоллекций.Вставить("Справочник.ФизическиеЛица","sotrudniki");
		
		Для Каждого стрМета Из Данные Цикл
			Если Не стрМета.Пометка Тогда
				Продолжить;
			КонецЕсли;
			
			Если стрМета.МетаПолноеИмя = "Справочник.Посетители" ИЛИ стрМета.МетаПолноеИмя = "Справочник.ФизическиеЛица" Тогда
				ПолучитьТаблицаСотрудников(ТаблицаСотрудников);
			КонецЕсли;
			
			Если стрМета.МетаПолноеИмя = "Справочник.ПодразделенияКомпании" Тогда
				ПолучитьТаблицаПодразделений(ТаблицаПодразделений);
			КонецЕсли;
			
			Если стрМета.МетаПолноеИмя = "Справочник.ТорговыеПлощадки" Тогда
				ПолучитьТаблицаТочек(ТаблицаТочек);
			КонецЕсли;
			
			Если стрМета.МетаПолноеИмя = "Справочник.УслугиСервисДеск" Тогда
				ЗарегистрироватьУслуги();
			КонецЕсли;
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	МетаданныеИзменения.Ссылка КАК Ссылка
			|ИЗ
			|	" + стрМета.МетаПолноеИмя + ".Изменения КАК МетаданныеИзменения
			|ГДЕ
			|	Узел = &Узел";
			
			Запрос.УстановитьПараметр("Узел", УзелПланаОбмена);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			МассивЭлементов = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");
			
			ПланыОбмена.ВыбратьИзменения(УзелПланаОбмена, 1, МассивЭлементов);
			
			Коллекция = СоответствиеКоллекций.Получить(стрМета.МетаПолноеИмя);
			
			кэ = 0;
			Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка.Следующий() Цикл
				Если НужноВыгружать(Выборка.Ссылка, стрМета.МетаПолноеИмя, ТаблицаСотрудников, ТаблицаПодразделений, ТаблицаТочек) Тогда
					Если стрМета.МетаПолноеИмя = "Справочник.ТерриторииИсполнителей" Тогда
						document_ID	= Строка(Выборка.Ссылка.УникальныйИдентификатор());
						//document_ID	= Строка(Выборка.Ссылка.Владелец.УникальныйИдентификатор());
					Иначе
						document_ID	= Строка(Выборка.Ссылка.УникальныйИдентификатор());
					КонецЕсли;
					АдресРесурса= Обработки.СервисДеск.ПодготовитьАдресРесурса("PATCH", ПараметрыДляЗапроса.Project_ID, Коллекция, document_ID);
					ТелоЗапроса = Обработки.СервисДеск.ПодготовитьТелоЗапроса(ПараметрыДляЗапроса, СоединениеFire, Коллекция, Выборка.Ссылка);
					
					ОК = Обработки.СервисДеск.ИзменитьДокументы_PATCH(ПараметрыДляЗапроса, СоединениеFire, АдресРесурса, ТелоЗапроса);
					ВсеОК = ВсеОК И ОК;	
					
					Если ОК Тогда
						кэ = 1 + кэ;
					Иначе
						ПланыОбмена.ЗарегистрироватьИзменения(УзелПланаОбмена, Выборка.Ссылка);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			
			РезВО.ДобавитьКомментарий("Выгружено " + кэ + " " + стрМета.МетаПолноеИмя, СтрЗР);
			
			ПланыОбмена.УдалитьРегистрациюИзменений(УзелПланаОбмена,1);
			
		КонецЦикла;
		
		СоединениеFire = Неопределено;
		
		РезВО.ЗафиксироватьРезультатЖурналеВыполненияОбработок(СтрЗР,НЕ ЗначениеЗаполнено(ТекстОшибок));
		
		Возврат ВсеОК;
		
	КонецФункции
	
	Функция ВыгрузитьКалендарьВFirestore(Дата1, Дата2)	Экспорт
		
		ВсеОК = Истина;
		ПараметрыДляЗапроса = Новый Структура("Service_CloudFirestoreAPI, Service_IdentityToolkitAPI, Project_ID, Web_API_Key, UserUID");
		ЗаполнитьЗначенияСвойств(ПараметрыДляЗапроса, УзелПланаОбмена);
		СоединениеFire = Обработки.СервисДеск.СоединениеFire(ПараметрыДляЗапроса.Service_CloudFirestoreAPI);
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ДанныеПроизводственногоКалендаря.ПроизводственныйКалендарь КАК ПроизводственныйКалендарь,
		|	ДанныеПроизводственногоКалендаря.Дата КАК Дата,
		|	ДанныеПроизводственногоКалендаря.Год КАК Год,
		|	ДанныеПроизводственногоКалендаря.ВидДня КАК ВидДня,
		|	ДанныеПроизводственногоКалендаря.ДатаПереноса КАК ДатаПереноса
		|ИЗ
		|	РегистрСведений.ДанныеПроизводственногоКалендаря КАК ДанныеПроизводственногоКалендаря
		|ГДЕ
		|	ДанныеПроизводственногоКалендаря.Дата МЕЖДУ &Дата1 И &Дата2";
		
		Запрос.УстановитьПараметр("Дата1", Дата1);
		Запрос.УстановитьПараметр("Дата2", Дата2);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			document_ID = Формат(Выборка.Дата,"ДФ=yyyy_MM_dd");
			АдресРесурса= Обработки.СервисДеск.ПодготовитьАдресРесурса("PATCH", ПараметрыДляЗапроса.Project_ID, "working_time_calendar", document_ID);
			ТелоЗапроса = Обработки.СервисДеск.ПодготовитьТелоЗапроса(ПараметрыДляЗапроса, СоединениеFire, "working_time_calendar", Выборка);
			
			ОК = Обработки.СервисДеск.ИзменитьДокументы_PATCH(ПараметрыДляЗапроса, СоединениеFire, АдресРесурса, ТелоЗапроса);
			ВсеОК = ВсеОК И ОК;	
		КонецЦикла;
		
		СоединениеFire = Неопределено;
		
		Возврат ВсеОК;
		
	КонецФункции
	
	
	#КонецОбласти
	
	
	#Область СлужебныеПроцедурыИФункции
	
	
	Функция НужноВыгружать(Ссылка, МетаПолноеИмя, ТаблицаСотрудников, ТаблицаПодразделений, ТаблицаТочек)
		
		Если МетаПолноеИмя = "Справочник.РолиСервисДеск" ИЛИ МетаПолноеИмя = "Справочник.ТерриторииИсполнителей" ИЛИ  МетаПолноеИмя = "Справочник.УслугиСервисДеск" Тогда 
			Возврат Истина;
		ИначеЕсли МетаПолноеИмя = "Справочник.Посетители" ИЛИ  МетаПолноеИмя = "Справочник.ФизическиеЛица" Тогда
			Нужон = ТаблицаСотрудников.Найти(Ссылка, "Сотрудник") <> Неопределено;	
			Возврат Нужон;
		ИначеЕсли МетаПолноеИмя = "Справочник.ТорговыеПлощадки" Тогда
			ДатаОткрытия = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка,"ДатаОткрытия");
			ДатаЗакрытия = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка,"ДатаЗакрытия");
			ТочкаЗакрыта = ДатаЗакрытия > ДатаОткрытия И ТекущаяДата() > ДатаЗакрытия;
			Если ТочкаЗакрыта Тогда
				Возврат НЕ ТочкаЗакрыта;
			Иначе
				Нужон = ТаблицаТочек.Найти(Ссылка, "Точка") <> Неопределено;	
				Возврат Нужон;
			КонецЕсли;
		ИначеЕсли МетаПолноеИмя = "Справочник.ПодразделенияКомпании" Тогда
			Нужон = ТаблицаПодразделений.Найти(Ссылка, "Подразделение") <> Неопределено;	
			Возврат Нужон;
		КонецЕсли;
	КонецФункции
	
	
	#КонецОбласти
	
	
	#Область ВспомогательныеПроцедурыИФункции
	
	
	Процедура ЗарегистрироватьУслуги()
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	УслугиСервисДеск.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.УслугиСервисДеск КАК УслугиСервисДеск
		|ГДЕ
		|	НЕ УслугиСервисДеск.ЭтоГруппа
		|	И УслугиСервисДеск.Родитель В
		|			(ВЫБРАТЬ
		|				УслугиСервисДескИзменения.Ссылка КАК Ссылка
		|			ИЗ
		|				Справочник.УслугиСервисДеск.Изменения КАК УслугиСервисДескИзменения
		|			ГДЕ
		|				УслугиСервисДескИзменения.Ссылка.ЭтоГруппа
		|				И УслугиСервисДескИзменения.Узел = &Узел)";
		
		Запрос.УстановитьПараметр("Узел", УзелПланаОбмена);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ПланыОбмена.ЗарегистрироватьИзменения(УзелПланаОбмена, ВыборкаДетальныеЗаписи.Ссылка);
		КонецЦикла;
		
		
		
		//РезВО.ДобавитьКомментарий("Зарегистрировано " + ВыборкаДетальныеЗаписи.Количество() + " номенклатуры", СтрЗР);
		
	КонецПроцедуры
	
	Процедура ПолучитьТаблицаСотрудников(ТаблицаСотрудников)
		
		Если ЗначениеЗаполнено(ТаблицаСотрудников) Тогда Возврат; КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТорговыеПлощадкиДополнительныеРеквизиты.Значение КАК Сотрудник
		|ИЗ
		|	Справочник.ТорговыеПлощадки.ДополнительныеРеквизиты КАК ТорговыеПлощадкиДополнительныеРеквизиты
		|ГДЕ
		|	ТорговыеПлощадкиДополнительныеРеквизиты.Свойство.Имя = ""КураторПлощадки""
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	РолиСервисДескСотрудники.Сотрудник
		|ИЗ
		|	Справочник.РолиСервисДеск.Сотрудники КАК РолиСервисДескСотрудники";
		
		
		РезультатЗапроса = Запрос.Выполнить();
		ТаблицаСотрудников = РезультатЗапроса.Выгрузить();
		
	КонецПроцедуры
	
	Процедура ПолучитьТаблицаПодразделений(ТаблицаПодразделений)
		
		Если ЗначениеЗаполнено(ТаблицаПодразделений) Тогда Возврат; КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ТорговыеПлощадкиДополнительныеРеквизиты.Ссылка.ПодразделениеКомпании КАК Подразделение
		|ИЗ
		|	Справочник.ТорговыеПлощадки.ДополнительныеРеквизиты КАК ТорговыеПлощадкиДополнительныеРеквизиты
		|ГДЕ
		|	ТорговыеПлощадкиДополнительныеРеквизиты.Свойство.Имя = ""КураторПлощадки""";
		
		РезультатЗапроса = Запрос.Выполнить();
		ТаблицаПодразделений = РезультатЗапроса.Выгрузить();
		
	КонецПроцедуры
	
	Процедура ПолучитьТаблицаТочек(ТаблицаТочек)
		
		Если ЗначениеЗаполнено(ТаблицаТочек) Тогда Возврат; КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ТорговыеПлощадкиДополнительныеРеквизиты.Ссылка КАК Точка
		|ИЗ
		|	Справочник.ТорговыеПлощадки.ДополнительныеРеквизиты КАК ТорговыеПлощадкиДополнительныеРеквизиты
		|ГДЕ
		|	ТорговыеПлощадкиДополнительныеРеквизиты.Свойство.Имя = ""КураторПлощадки""";
		
		РезультатЗапроса = Запрос.Выполнить();
		ТаблицаТочек = РезультатЗапроса.Выгрузить();
		
	КонецПроцедуры
	
	
	#КонецОбласти
	
	
	
#Иначе
	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
